# UV Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
UV Properties
UV Class See Also
---
The UV type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| BasisU | The basis of the U axis. |
| BasisV | The basis of the V axis. |
| Item |
| U | Gets the first coordinate. |
| V | Gets the second coordinate. |
| Zero | The coordinate origin or zero 2-D vector. |

# See Also
UV Class
Autodesk.Revit.DB Namespace